# IsSpare Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..IsSpare Method
PanelScheduleView Class See Also
---
Check if the circuit is a spare
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSpare(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function IsSpare ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSpare(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row Number
nCol
    Type: System..::..Int32 Column Number
# ### Return Value
True if the circuit is a spare, false otherwise
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace